mesh/cfMesh/elbowCfmesh/0.org/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.001;

boundaryField
{
    inletLarge
    {
        type            fixedValue;
        value           uniform 0.015;
    }

    inletSmall
    {
        type            fixedValue;
        value           uniform 0.09;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      $internalField;
    }

    "wall.*"
    {
        type            kqRWallFunction;
        value           uniform 0;
    }
}


// ************************************************************************* //
